note/drawio/converted/dot/260420-timer.dot
digraph G {
  graph [rankdir=LR];
  node [shape=box, style="rounded,filled", fillcolor="#f8f9fb", color="#5b6b7a", fontname="Arial"];
  "n_J12zfHYe7umViCaIBjcA_1" [label="node_BjcA-1"];
  "n_J12zfHYe7umViCaIBjcA_10" [label="w_clear"];
  "n_J12zfHYe7umViCaIBjcA_11" [label="w_updown"];
  "n_J12zfHYe7umViCaIBjcA_12" [label="w_runstop"];
  "n_J12zfHYe7umViCaIBjcA_13" [label="timer_datapath"];
  "n_J12zfHYe7umViCaIBjcA_15" [label="100Hz tick"];
  "n_J12zfHYe7umViCaIBjcA_16" [label="tick_gen _100hz"];
  "n_J12zfHYe7umViCaIBjcA_18" [label="7"];
  "n_J12zfHYe7umViCaIBjcA_19" [label="msec_tick_count"];
  "n_J12zfHYe7umViCaIBjcA_2" [label="timer_fsm"];
  "n_J12zfHYe7umViCaIBjcA_21" [label="6"];
  "n_J12zfHYe7umViCaIBjcA_22" [label="sec_tick_count"];
  "n_J12zfHYe7umViCaIBjcA_24" [label="o_sec_tick"];
  "n_J12zfHYe7umViCaIBjcA_25" [label="i_tick"];
  "n_J12zfHYe7umViCaIBjcA_29" [label="min_tick_count"];
  "n_J12zfHYe7umViCaIBjcA_31" [label="5"];
  "n_J12zfHYe7umViCaIBjcA_32" [label="hour_tick_count"];
  "n_J12zfHYe7umViCaIBjcA_33" [label="o_hour_tick"];
  "n_J12zfHYe7umViCaIBjcA_34" [label="i_tick"];
  "n_J12zfHYe7umViCaIBjcA_35" [label="o_min_tick"];
  "n_J12zfHYe7umViCaIBjcA_36" [label="i_tick"];
  "n_J12zfHYe7umViCaIBjcA_38" [label="24"];
  "n_J12zfHYe7umViCaIBjcA_39" [label="o_timer_value"];
  "n_dzaaVQqeaylpm1ZTDdp1_15" [label="i_btnL"];
  "n_dzaaVQqeaylpm1ZTDdp1_16" [label="i_btnU"];
  "n_dzaaVQqeaylpm1ZTDdp1_18" [label="i_btnD"];
  "n_dzaaVQqeaylpm1ZTDdp1_24" [label="i_sw0"];
  "n_J12zfHYe7umViCaIBjcA_2" -> "n_J12zfHYe7umViCaIBjcA_16";
  "n_J12zfHYe7umViCaIBjcA_2" -> "n_J12zfHYe7umViCaIBjcA_16";
  "n_J12zfHYe7umViCaIBjcA_19" -> "n_J12zfHYe7umViCaIBjcA_22";
  "n_J12zfHYe7umViCaIBjcA_22" -> "n_J12zfHYe7umViCaIBjcA_29";
  "n_J12zfHYe7umViCaIBjcA_29" -> "n_J12zfHYe7umViCaIBjcA_32";
}
