note/drawio/converted/mermaid/260420-timer.mmd
flowchart LR
  n_J12zfHYe7umViCaIBjcA_1["node_BjcA-1"]
  n_J12zfHYe7umViCaIBjcA_10["w_clear"]
  n_J12zfHYe7umViCaIBjcA_11["w_updown"]
  n_J12zfHYe7umViCaIBjcA_12["w_runstop"]
  n_J12zfHYe7umViCaIBjcA_13["timer_datapath"]
  n_J12zfHYe7umViCaIBjcA_15["100Hz tick"]
  n_J12zfHYe7umViCaIBjcA_16["tick_gen _100hz"]
  n_J12zfHYe7umViCaIBjcA_18["7"]
  n_J12zfHYe7umViCaIBjcA_19["msec_tick_count"]
  n_J12zfHYe7umViCaIBjcA_2["timer_fsm"]
  n_J12zfHYe7umViCaIBjcA_21["6"]
  n_J12zfHYe7umViCaIBjcA_22["sec_tick_count"]
  n_J12zfHYe7umViCaIBjcA_24["o_sec_tick"]
  n_J12zfHYe7umViCaIBjcA_25["i_tick"]
  n_J12zfHYe7umViCaIBjcA_29["min_tick_count"]
  n_J12zfHYe7umViCaIBjcA_31["5"]
  n_J12zfHYe7umViCaIBjcA_32["hour_tick_count"]
  n_J12zfHYe7umViCaIBjcA_33["o_hour_tick"]
  n_J12zfHYe7umViCaIBjcA_34["i_tick"]
  n_J12zfHYe7umViCaIBjcA_35["o_min_tick"]
  n_J12zfHYe7umViCaIBjcA_36["i_tick"]
  n_J12zfHYe7umViCaIBjcA_38["24"]
  n_J12zfHYe7umViCaIBjcA_39["o_timer_value"]
  n_dzaaVQqeaylpm1ZTDdp1_15["i_btnL"]
  n_dzaaVQqeaylpm1ZTDdp1_16["i_btnU"]
  n_dzaaVQqeaylpm1ZTDdp1_18["i_btnD"]
  n_dzaaVQqeaylpm1ZTDdp1_24["i_sw0"]
  n_J12zfHYe7umViCaIBjcA_2 --> n_J12zfHYe7umViCaIBjcA_16
  n_J12zfHYe7umViCaIBjcA_2 --> n_J12zfHYe7umViCaIBjcA_16
  n_J12zfHYe7umViCaIBjcA_19 --> n_J12zfHYe7umViCaIBjcA_22
  n_J12zfHYe7umViCaIBjcA_22 --> n_J12zfHYe7umViCaIBjcA_29
  n_J12zfHYe7umViCaIBjcA_29 --> n_J12zfHYe7umViCaIBjcA_32
